/*
Создайте класс с именем fraction, содержащий два поля типа int - числитель и знаменатель обыкновенной дроби.
Конструктор класса должен инициализировать их заданным набором значений;
Создайте метод класса, который будет выводить дробь в текстовую строку в формате x / y;
Mетод, добавляющий (сложение) к текущей дроби дробь, переданную ему в параметре и возвращающий дробь - результат сложения;
Метод, умножающий (произведение) текущую дробь на число типа double, переданное ему в параметре и возвращающий дробь - результат умножения;
Метод, делящий (деление) текущую дробь на число типа double, переданное ему в параметре и возвращающий дробь - результат деления.
 */

public class Fraction {
    private int numerator;
    private int denominator;

    public Car() {

    }
    
}
