//Парк общественного транспорта.
//Определить иерархию различных видов ОТ.
//Создать парк ОТ.
//Рассчитать стоимость автопарка.
//Провести сортировку машин парка по расходу топлива.
//Найти автобус в компании, соответствующий заданному диапазону параметров.

public class Main {
    public static void main(String[] args) {

        System.out.println("Hello world!");
    }
}